duxinglang-1/nRF9160_test/E2_TEST/src/screen/screen.c
	SetLeftKeyUpHandler(fota_start_confirm);
	SetRightKeyUpHandler(fota_exit);
#ifdef CONFIG_TOUCH_SUPPORT
	register_touch_event_handle(TP_EVENT_SINGLE_CLICK, FOTA_NOTIFY_YES_X, FOTA_NOTIFY_YES_X+FOTA_NOTIFY_YES_W, FOTA_NOTIFY_YES_Y, FOTA_NOTIFY_YES_Y+FOTA_NOTIFY_YES_H, fota_start_confirm);
	register_touch_event_handle(TP_EVENT_SINGLE_CLICK, FOTA_NOTIFY_NO_X, FOTA_NOTIFY_NO_X+FOTA_NOTIFY_NO_W, FOTA_NOTIFY_NO_Y, FOTA_NOTIFY_NO_Y+FOTA_NOTIFY_NO_H, fota_exit);
#endif
	
}

void FOTAUpdateStatus(void)
{
	u16_t pro_len;
	u16_t x,y,w,h;
	u8_t pro_buf[16] = {0};
	static bool flag = false;
	static u16_t pro_str_x,pro_str_y;
	
	switch(get_fota_status())
	{
	case FOTA_STATUS_PREPARE:
		flag = false;
		break;
		
	case FOTA_STATUS_LINKING:
		LCD_Fill(FOTA_NOTIFY_RECT_X+1, FOTA_NOTIFY_STRING_Y, FOTA_NOTIFY_RECT_W-1, FOTA_NOTIFY_RECT_H-(FOTA_NOTIFY_STRING_Y-FOTA_NOTIFY_RECT_Y)-1, BLACK);
		ShowStringsInRect(FOTA_NOTIFY_STRING_X,
						  FOTA_NOTIFY_STRING_Y,
						  FOTA_NOTIFY_STRING_W,
						  FOTA_NOTIFY_STRING_H,
						  FONT_SIZE_16,
						  "Linking to server...");

		ClearAllKeyHandler();
		break;
		
	case FOTA_STATUS_DOWNLOADING:
		if(!flag)
		{
			flag = true;
			
			LCD_Fill(FOTA_NOTIFY_STRING_X, FOTA_NOTIFY_STRING_Y, FOTA_NOTIFY_STRING_W, FOTA_NOTIFY_STRING_H, BLACK);
			ShowStringsInRect(FOTA_NOTIFY_STRING_X, 
							  FOTA_NOTIFY_STRING_Y,
							  FOTA_NOTIFY_STRING_W,
							  40,
							  FONT_SIZE_16,
							  "Downloading data...");
			
			LCD_DrawRectangle(FOTA_NOTIFY_PRO_X, FOTA_NOTIFY_PRO_Y, FOTA_NOTIFY_PRO_W, FOTA_NOTIFY_PRO_H);
			LCD_Fill(FOTA_NOTIFY_PRO_X+1, FOTA_NOTIFY_PRO_Y+1, FOTA_NOTIFY_PRO_W-1, FOTA_NOTIFY_PRO_H-1, BLACK);

			sprintf(pro_buf, "%3d%%", g_fota_progress);
			LCD_MeasureString(pro_buf, &w, &h);
			pro_str_x = ((FOTA_NOTIFY_RECT_W-2*FOTA_NOTIFY_OFFSET_W)-w)/2;
			pro_str_x += (FOTA_NOTIFY_RECT_X+FOTA_NOTIFY_OFFSET_W);
			pro_str_y = FOTA_NOTIFY_PRO_Y + FOTA_NOTIFY_PRO_H + 5;
			
			LCD_ShowString(pro_str_x,pro_str_y, pro_buf);
		}
		else
		{
			pro_len = (g_fota_progress*FOTA_NOTIFY_PRO_W)/100;
			LCD_Fill(FOTA_NOTIFY_PRO_X+1, FOTA_NOTIFY_PRO_Y+1, pro_len, FOTA_NOTIFY_PRO_H-1, WHITE);

			sprintf(pro_buf, "%3d%%", g_fota_progress);
			LCD_ShowString(pro_str_x, pro_str_y, pro_buf);
		}

		ClearAllKeyHandler();
		break;
		
	case FOTA_STATUS_FINISHED:
		flag = false;
		
		LCD_Fill(FOTA_NOTIFY_RECT_X+1, FOTA_NOTIFY_STRING_Y, FOTA_NOTIFY_RECT_W-1, FOTA_NOTIFY_RECT_H-(FOTA_NOTIFY_STRING_Y-FOTA_NOTIFY_RECT_Y)-1, BLACK);
		ShowStringsInRect(FOTA_NOTIFY_STRING_X,
						  FOTA_NOTIFY_STRING_Y,
						  FOTA_NOTIFY_STRING_W,
						  FOTA_NOTIFY_STRING_H,
						  FONT_SIZE_16,
						  "It upgraded successfully! Do you want to reboot the device immediately?");

		LCD_DrawRectangle(FOTA_NOTIFY_YES_X, FOTA_NOTIFY_YES_Y, FOTA_NOTIFY_YES_W, FOTA_NOTIFY_YES_H);
		LCD_MeasureString("SOS(Y)", &w, &h);
		x = FOTA_NOTIFY_YES_X+(FOTA_NOTIFY_YES_W-w)/2;
		y = FOTA_NOTIFY_YES_Y+(FOTA_NOTIFY_YES_H-h)/2;	
		LCD_ShowString(x,y,"SOS(Y)");

		LCD_DrawRectangle(FOTA_NOTIFY_NO_X, FOTA_NOTIFY_NO_Y, FOTA_NOTIFY_NO_W, FOTA_NOTIFY_NO_H);
		LCD_MeasureString("PWR(N)", &w, &h);
		x = FOTA_NOTIFY_NO_X+(FOTA_NOTIFY_NO_W-w)/2;
		y = FOTA_NOTIFY_NO_Y+(FOTA_NOTIFY_NO_H-h)/2;	
		LCD_ShowString(x,y,"PWR(N)");

		SetLeftKeyUpHandler(fota_reboot_confirm);
		SetRightKeyUpHandler(fota_exit);
		break;
		
	case FOTA_STATUS_ERROR:
		flag = false;

		LCD_Fill(FOTA_NOTIFY_RECT_X+1, FOTA_NOTIFY_STRING_Y, FOTA_NOTIFY_RECT_W-1, FOTA_NOTIFY_RECT_H-(FOTA_NOTIFY_STRING_Y-FOTA_NOTIFY_RECT_Y)-1, BLACK);
		ShowStringsInRect(FOTA_NOTIFY_STRING_X,
						  FOTA_NOTIFY_STRING_Y,
						  FOTA_NOTIFY_STRING_W,
						  FOTA_NOTIFY_STRING_H,
						  FONT_SIZE_16,
						  "It failed to upgrade! Please check the network or server.");

		LCD_DrawRectangle((LCD_WIDTH-FOTA_NOTIFY_YES_W)/2, FOTA_NOTIFY_YES_Y, FOTA_NOTIFY_YES_W, FOTA_NOTIFY_YES_H);
		LCD_MeasureString("SOS(Y)", &w, &h);
		x = (LCD_WIDTH-FOTA_NOTIFY_YES_W)/2+(FOTA_NOTIFY_YES_W-w)/2;
		y = FOTA_NOTIFY_YES_Y+(FOTA_NOTIFY_YES_H-h)/2;	
		LCD_ShowString(x,y,"SOS(Y)");

		SetLeftKeyUpHandler(fota_exit);
		SetRightKeyUpHandler(fota_exit);
		break;
		
	case FOTA_STATUS_MAX:
		flag = false;
		break;
	}
}

void FOTAScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_FOTA].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_FOTA].act = SCREEN_ACTION_NO;
		scr_msg[SCREEN_ID_FOTA].status = SCREEN_STATUS_CREATED;

		FOTAShowStatus();
		break;
		
	case SCREEN_ACTION_UPDATE:
		if(scr_msg[SCREEN_ID_FOTA].para&SCREEN_EVENT_UPDATE_FOTA)
		{
			scr_msg[SCREEN_ID_FOTA].para &= (~SCREEN_EVENT_UPDATE_FOTA);
			FOTAUpdateStatus();
		}

		if(scr_msg[SCREEN_ID_FOTA].para == SCREEN_EVENT_UPDATE_NO)
			scr_msg[SCREEN_ID_FOTA].act = SCREEN_ACTION_NO;
		break;
	}
}

void ExitFOTAScreen(void)
{
#ifdef CONFIG_DATA_DOWNLOAD_SUPPORT
#ifdef CONFIG_IMG_DATA_UPDATE
	dl_img_start();
#elif defined(CONFIG_FONT_DATA_UPDATE)
	dl_font_start();
#elif defined(CONFIG_PPG_DATA_UPDATE)
	dl_ppg_start();
#endif
#else
	EnterPoweroffScreen();
#endif
}

void EnterFOTAScreen(void)
{
	if(screen_id == SCREEN_ID_FOTA)
		return;

	history_screen_id = screen_id;
	scr_msg[history_screen_id].act = SCREEN_ACTION_NO;
	scr_msg[history_screen_id].status = SCREEN_STATUS_NO;

	screen_id = SCREEN_ID_FOTA;	
	scr_msg[SCREEN_ID_FOTA].act = SCREEN_ACTION_ENTER;
	scr_msg[SCREEN_ID_FOTA].status = SCREEN_STATUS_CREATING;
}
#endif/*CONFIG_FOTA_DOWNLOAD*/

#ifdef CONFIG_IMU_SUPPORT
void SleepScreenProcess(void)
{
	u16_t x,y,w,h;
	u16_t deep_sleep,light_sleep;
	u8_t notify[64] = "Sleep";
	u8_t tmpbuf[64] = {0};
	
	switch(scr_msg[SCREEN_ID_SLEEP].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_SLEEP].act = SCREEN_ACTION_NO;
		scr_msg[SCREEN_ID_SLEEP].status = SCREEN_STATUS_CREATED;
				
		LCD_Clear(BLACK);
		LCD_SetFontSize(FONT_SIZE_24);
		LCD_MeasureString(notify,&w,&h);
		x = (w > LCD_WIDTH)? 0 : (LCD_WIDTH-w)/2;
		y = 50;
		LCD_ShowString(x,y,notify);

		GetSleepTimeData(&deep_sleep, &light_sleep);
		LCD_SetFontSize(FONT_SIZE_16);
		LCD_MeasureString("TOTAL_SLEEP:        ",&w,&h);
		x = (w > LCD_WIDTH)? 0 : (LCD_WIDTH-w)/2;
		y = 100;
		LCD_ShowString(x,y,"TOTAL_SLEEP:        ");
		sprintf(tmpbuf, "%d (min)", deep_sleep+light_sleep);
		LCD_ShowString(x+13*FONT_SIZE_16/2, y, tmpbuf);

